#lang planet neil/sicp
;
;create by jim at 19:51 2013/7/18
(define (cube x) (* x x x))

(define (p x) (- (* 3 x) (* 4 (cube x))))

(define (sine angle) (if (not(> (abs angle) 0.1))
                         angle
                         (p (sine (/ angle 3.0)))))


;answer 1:需要5次
; (sine 12.15)
;  (sine 4.05)
;   (sine 1.35)
;    (sine 0.45)
;     (sine 0.15)
;      (sine 0.05)
;     (p 0.05)
;     (cube 0.05)
;    (p 0.1495)
;     (cube 0.1495)
;   (p 0.4351345505)
;    (cube 0.4351345505)
;  (p 0.9758465331678770763868813495)
;   (cube 0.9758465331678770763868813495)
; (p -0.7895631144708220087624507318397201180692771830771988814099607830750233107352090495)
;  (cube -0.7895631144708220087624507318397201180692771830771988814099607830750233107352090495)

;answer 2:
;设步数为n，a连续n次除以3恰好第一次小于0.1，步数增长的阶为O(lg2 n)
;使用的空间：尤其为递归，会保持一条计算链，与步数相关， 为O(lg2 n)



